{
  "body": [
    {
      "year": "Mar 2024 - Present",
      "company": "Zimpligital",
      "position": "Mobile Application Developer (Flutter)",
      "description": [
        "Architectural Leadership: Spearheaded the complete migration of legacy code modules to Clean Architecture, significantly enhancing system scalability and testability.",
        "Offline-First Strategy: Engineered a high-performance local data layer with ISAR Database, optimizing real-time message caching for a seamless offline experience.",
        "Design System: Led the collaboration with UX/UI designers to build a unified Design System and reusable widget library, significantly cutting development time and ensuring UI/UX consistency.",
        "Real-time & Security: Architected low-latency messaging via Socket.io/LiveKit, incorporating secure authentication, message reactions, and E2EE for privacy and engagement."
      ]
    },
    {
      "year": "Jun 2021 - Feb 2024",
      "company": "SkinX (Thailand's Leading Telemedicine Platform)",
      "position": "Software Engineer (Promoted from Part-time)",
      "description": [
        "High-Scale Impact: Served as a core developer for a platform with 800k+ downloads and 50k+ MAU, directly contributing to 80% of all major core features.",
        "Ecosystem Management: Developed and maintained the entire Flutter ecosystem, including Client and Doctor apps for both iOS and Android using Bloc and GetX.",
        "Telehealth & E-commerce: Integrated stable Voice/Video features via Agora.io and implemented secure end-to-end shopping flows with integrated payment gateways.",
        "DevOps: Automated deployment to App Store/Google Play via CI/CD pipelines, reducing manual release overhead."
      ]
    },
    {
      "year": "Jan 2021 - Apr 2021",
      "company": "MFEC Public Company Limited",
      "position": "Flutter Developer (Internship)",
      "description": [
        "Developed E-commerce and Video Streaming apps and built Platform Channels for native Android/iOS integration."
      ]
    }
  ]
}
